app/views/developers/show_profile.html.erb

			<% if post.kind == 'Job Application' %>
				<a href="/developers/show_profile?id=<%= Developer.find(JobApplication.find(post.application).developer).id %>"><img id="card-img-top" src="<%= Developer.find(JobApplication.find(post.application).developer).profile_image.url %>" style="border-radius: 50%; height:50px; margin-bottom:10px;" /></a>
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 ORDER BY "developers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

			<% elsif post.kind == 'Side Project' %>
				<a href="/developers/show_profile?id=<%= Developer.find(SideProject.find(post.side_project).developer_id).id %>"><img id="card-img-top" src="<%= Developer.find(SideProject.find(post.side_project).developer_id).profile_image.url %>" style="border-radius: 50%; height:50px; margin-bottom:10px;" /></a>
---
SELECT  "side_projects".* FROM "side_projects" WHERE "side_projects"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]