app/views/jobs/index.html.erb


				<% if !JobApplication.where(:job => job.id, :developer => current_developer.id).empty? %>
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 ORDER BY "developers"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  1 AS one FROM "job_applications" WHERE "job_applications"."job" = $1 AND "job_applications"."developer" = $2 LIMIT $3  [["job", 229], ["developer", 3], ["LIMIT", 1]]