app/views/welcome/frontpage.erb

		<% if post.kind == 'Job Application' %>
			<a href="/developers/show_profile?id=<%= Developer.find(JobApplication.find(post.application).developer).id %>"><img id="card-img-top" src="<%= Developer.find(JobApplication.find(post.application).developer).profile_image.url %>" style="border-radius: 50%; height:50px; margin-bottom:10px;" /></a>
			<p style="margin: 0px; margin-top: 0px;"><b><%= Developer.find(JobApplication.find(post.application).developer).name %> just applied for a job: <%= Job.find(JobApplication.find(post.application).job).url %></b> (+1 points)</p>
		<% elsif post.kind == 'Side Project' %>
			<a href="/developers/show_profile?id=<%= Developer.find(SideProject.find(post.side_project).developer_id).id %>"><img id="card-img-top" src="<%= Developer.find(SideProject.find(post.side_project).developer_id).profile_image.url %>" style="border-radius: 50%; height:50px; margin-bottom:10px;" /></a>
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "developers".* FROM "developers" WHERE ("developers"."name" IS NOT NULL)
SELECT  "side_projects".* FROM "side_projects" WHERE "side_projects"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]