app/views/side_projects/index.html.erb

		<p style="margin: 0px; margin-top: 0px;"><b><%= sp.name %></b></p>
		<p style="margin: 30px;"><%= sp.description %> (<a href="/developers/show_profile?id=<%= sp.developer_id %>">Made by <%= Developer.find(sp.developer_id).name %></a>)</p>
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]