app/views/side_projects/show.html.erb

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
		<% end %>
		<a style="font-size: 11px; color:grey;" href='/developers/show_profile?id=<%= @side_project.developer_id %>'>Made by <%= Developer.find(@side_project.developer_id).name %></a><br>