app/controllers/applications_controller.rb

	def create
	    @application = Application.new(post_params)
	    @post = Post.new
	    @post.developer = current_developer.id

	    @post.body = current_developer.name + ' just applied for this job: ' + post_params[:job]
	    @post.save

	    if @application.save
---
INSERT INTO "posts" ("developer", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["developer", 2], ["body", "Vignesh M just applied for this job: twitter.com/jobs/23"], ["created_at", "2018-04-15 09:06:29.427375"], ["updated_at", "2018-04-15 09:06:29.427375"]]
INSERT INTO "applications" ("created_at", "updated_at", "job") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2018-04-15 08:59:14.233736"], ["updated_at", "2018-04-15 08:59:14.233736"], ["job", "asd"]]