app/controllers/developers_controller.rb

SELECT "developers".* FROM "developers"
---
	def index
		@developers = Developer.all

INSERT INTO "developers" ("name", "bio", "personal_website", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
	    @developer = Developer.new(post_params)
	    @developer.CV_counter = 0
	    if @developer.save

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
	def edit
		@developer = Developer.find(params[:id])

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 ORDER BY "developers"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "developers" SET "profile_image_file_name" = $1, "profile_image_updated_at" = $2, "updated_at" = $3 WHERE "developers"."id" = $4  [["profile_image_file_name", "25727274.png"], ["profile_image_updated_at", "2018-03-23 13:56:37.981708"], ["updated_at", "2018-03-23 13:56:37.999132"], ["id", 1]]
---
	def update
    	@developer = Developer.find(params[:id])

    	if @developer.update(post_params)

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 ORDER BY "developers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  	def profile
    	@developer = Developer.find(current_developer.id)

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 ORDER BY "developers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  	def edit_profile
		@developer = Developer.find(current_developer.id)

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 ORDER BY "developers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "side_projects".* FROM "side_projects" WHERE "side_projects"."developer_id" = $1  [["developer_id", 1]]
SELECT "posts".* FROM "posts"
SELECT  "side_projects".* FROM "side_projects" WHERE "side_projects"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def show_profile
		@developer = Developer.find(params[:id])
		@side_projects = SideProject.where(:developer_id => params[:id]).reverse
		@all_posts = Post.all
		@posts = []
		@all_posts.each do |post|
			if post.kind == 'Side Project'
				if SideProject.find(post.side_project).developer_id == params[:id]
					@posts.push(post)
				end
			elsif post.kind == 'Job Application'
				if JobApplication.find(post.application).developer == params[:id]

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "developers" WHERE "developers"."id" = $1  [["id", 3]]
---
	def destroy
		@developer = Developer.find(params[:id])

	    @developer.destroy