app/controllers/developers_controller.rb

	def show
		@developer = Developer.find(params[:id])
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = $1 ORDER BY "developers"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]