app/controllers/jobs_controller.rb

	def create
	    @job = Job.new(post_params)

	    if @job.save
	   	  	# Create a new post for the frontpage
		    @post = Post.new
		    @post.developer = current_developer.id
		    @post.body = current_developer.name + ' just applied for a new job: ' + post_params[:url]
		    @post.save

		    # Update his/her CV counter
		    current_developer.CV_counter = current_developer.CV_counter + 1
		    current_developer.points = current_developer.points + 1

	    	current_developer.save
---
UPDATE "developers" SET "CV_counter" = $1, "points" = $2, "updated_at" = $3 WHERE "developers"."id" = $4  [["CV_counter", 1], ["points", 1], ["updated_at", "2018-04-29 16:54:51.877566"], ["id", 3]]