app/controllers/jobs_controller.rb

	def create
	    @job = Job.new(post_params)
	    @job.creator = current_developer.id

	    if @job.save
---
INSERT INTO "posts" ("developer", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["developer", 1], ["body", "Alex just applied for a new job: asd"], ["created_at", "2018-04-17 08:53:35.564850"], ["updated_at", "2018-04-17 08:53:35.564850"]]

	def destroy
		@job = Job.find(params[:id])

		@applications = JobApplication.where(:job => @job.id)
		@applications.each do |application|
			@posts = Post.where(:application => application.id)
			@posts.each do |post|
				post.destroy
			end
			application.destroy
---
SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."job" = $1  [["job", 230]]
SELECT "posts".* FROM "posts" WHERE "posts"."application" = $1  [["application", 18]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 36]]
DELETE FROM "job_applications" WHERE "job_applications"."id" = $1  [["id", 18]]

	def checkAppliedCheckbox
		# Create a new application and save it
		@application = JobApplication.new
		@application.job = params[:job]
	    @application.developer = current_developer.id
	    @application.save

	    @post = Post.new
	    @post.kind = 'Job Application'
	    @post.application = @application.id
	    @post.save

	    # Update his/her CV counter and save
	    current_developer.CV_counter = current_developer.CV_counter + 1
	    current_developer.points = current_developer.points + 1

    	current_developer.save
---
INSERT INTO "job_applications" ("created_at", "updated_at", "developer", "job") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-05-01 15:00:50.441501"], ["updated_at", "2018-05-01 15:00:50.441501"], ["developer", 3], ["job", 0]]
INSERT INTO "posts" ("created_at", "updated_at", "kind", "application") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-05-01 15:10:00.293859"], ["updated_at", "2018-05-01 15:10:00.293859"], ["kind", "Job Application"], ["application", 7]]
UPDATE "developers" SET "CV_counter" = $1, "points" = $2, "updated_at" = $3 WHERE "developers"."id" = $4  [["CV_counter", 5], ["points", 30], ["updated_at", "2018-05-01 15:10:00.299110"], ["id", 3]]

	def uncheckAppliedCheckbox
		# Find the job application and post, delete them
		@application = JobApplication.where(:job => params[:job], :developer => current_developer.id).first
	    @post = Post.where(:kind => 'Job Application', :application => @application.id).first

	    puts @post

	    @application.destroy
	    @post.destroy

	    # Update his/her CV counter and save it
	    current_developer.CV_counter = current_developer.CV_counter - 1
	    current_developer.points = current_developer.points - 1

    	current_developer.save
---
SELECT  "job_applications".* FROM "job_applications" WHERE "job_applications"."job" = $1 AND "job_applications"."developer" = $2 ORDER BY "job_applications"."id" ASC LIMIT $3  [["job", 230], ["developer", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."kind" = $1 AND "posts"."application" IN (SELECT "job_applications"."id" FROM "job_applications" WHERE "job_applications"."job" = $2 AND "job_applications"."developer" = $3)  [["kind", "Job Application"], ["job", 0], ["developer", 3]]
DELETE FROM "job_applications" WHERE "job_applications"."id" = $1  [["id", 5]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 34]]
UPDATE "developers" SET "CV_counter" = $1, "points" = $2, "updated_at" = $3 WHERE "developers"."id" = $4  [["CV_counter", 13], ["points", 38], ["updated_at", "2018-05-01 15:30:06.735592"], ["id", 3]]