app/controllers/side_projects_controller.rb

	def index
		@side_projects = SideProject.all.reverse
---
SELECT "side_projects".* FROM "side_projects"

	def create
	    @side_project = SideProject.new(post_params)
	    @side_project.developer_id = current_developer.id

	    if @side_project.save

	    	@post = Post.new
	    	@post.developer = current_developer.id
	    	@post.body = current_developer.name + ' just created a new side project: ' + post_params[:name]
	    	@post.save

	    	current_developer.CV_counter = current_developer.CV_counter + 1
	    	current_developer.save
---
INSERT INTO "posts" ("developer", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["developer", 1], ["body", "Alex Sideris just created a new side project: MultiNewTab"], ["created_at", "2018-04-17 19:16:59.091727"], ["updated_at", "2018-04-17 19:16:59.091727"]]
INSERT INTO "side_projects" ("name", "description", "github_repo", "website", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "tech_stack", "developer_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
UPDATE "developers" SET "side_project_counter" = $1, "points" = $2, "updated_at" = $3 WHERE "developers"."id" = $4  [["side_project_counter", 1], ["points", 27], ["updated_at", "2018-04-29 16:58:29.025181"], ["id", 3]]

	def edit
		@side_project = SideProject.find(params[:id])
---
SELECT  "side_projects".* FROM "side_projects" WHERE "side_projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
    	@side_project = SideProject.find(params[:id])

    	if @side_project.update(post_params)
---
SELECT  "side_projects".* FROM "side_projects" WHERE "side_projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "side_projects" SET "description" = $1, "updated_at" = $2 WHERE "side_projects"."id" = $3  [["description", "Show off your work, land a remote junior job."], ["updated_at", "2018-04-18 15:52:02.929811"], ["id", 6]]

	def show
		@side_project = SideProject.find(params[:id])
---
SELECT  "side_projects".* FROM "side_projects" WHERE "side_projects"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

	def edit_side_projects
		@side_projects = SideProject.where(:developer_id => current_developer.id).reverse
---
SELECT "side_projects".* FROM "side_projects" WHERE "side_projects"."developer_id" = $1  [["developer_id", 1]]