app/controllers/welcome_controller.rb

  def index
  	@developers = Developer.all
---
SELECT  "developers".* FROM "developers" LIMIT $1  [["LIMIT", 11]]