app/controllers/welcome_controller.rb

  def index
  	@developers = Developer.where.not(name: nil).sort_by(&:points).reverse.first(6)
  	@side_projects = SideProject.all.first(6)
---
SELECT  "developers".* FROM "developers" WHERE ("developers"."name" IS NOT NULL) ORDER BY "developers"."id" ASC LIMIT $1  [["LIMIT", 6]]
SELECT  "side_projects".* FROM "side_projects" ORDER BY "side_projects"."id" ASC LIMIT $1  [["LIMIT", 6]]

  def frontpage
  	@developers = Developer.where.not(name: nil).sort_by(&:points).reverse
  	@posts = Post.all.reverse
---
SELECT "developers".* FROM "developers" WHERE ("developers"."name" IS NOT NULL)
SELECT "posts".* FROM "posts"

  def chat
  	@developers = Developer.where.not(name: nil)
  	@posts = Post.all.reverse
---
SELECT "posts".* FROM "posts"